/*============================================================================
* Copyright (C) 2018 Ltd. All rights reserved.
* Author  : SteveNo10
* Time    : 2018-09-11
* Descript: 
* printf format %[flags][width][.prec][length]type
*
*   flags:
*      '    将整数按千位分组字符
*      -    字段内左对齐
*      +    输出正负号
*   (space) 正数输出空格,负数输出负号 
*      #    type为 o/x/X时,增加前缀0/0x/0X
*           type为 a/A/e/E/f/g/G时,一定使用小数点。如果用.0控制不输出小数部分，则不输出小数点
*           type为 g/G时,尾部的0保留
*      0    前面补0,直至占满列宽(不可搭配使用-)
*
*  width:   十进制表示最小输出位数，实际少则补0或空格，多则按实际输出
*      十进制整数   输出位数
*      *            参数列表给出最小宽度
*
*  .prec:   .开头,后跟十进制整数
*      .数值   对于整数(d/i/o/u/x/X),表示最小数字个数,不足前补0,超过不截断
*              对于浮点(a/A/e/E/f),表示小数点后位数,默认六位,不足后补0,超过截断
*              对于(g/G),可输出的最大有效数字
*              对于字符串(s),表示最大可输出字符数,不足正常输出,超过则截断
*      *       参数列表给出精度
*  length:
============================================================================*/

#include <stdio.h>

int main(int, char**)
{
    printf("%*d", 10, 1);

    return 0;
}
